Tekla Open API Reference for Tekla Structures 2025
Color.Red Property
 The red value of the color, between 0.0 and 1.0.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Red { get; set; }
Public Property Red As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Color Class
Tekla.Structures.Model.UI Namespace